УТ/src/Catalogs/CRM_ПравилаРасчетаКачестваЗаполненияДанных/CRM_ПравилаРасчетаКачестваЗаполненияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ПравилаРасчетаКачестваЗаполненияДанных</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРаботыСКлиентом</name>
    <comment>Статус работы с клиентом</comment>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Правила</name>
    <attributes>
      <name>Условие</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПредставлениеДляПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Партнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <comment>Используется для группировки по территориальному признаку</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <comment>Клиенты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>Поставщики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Публичное наименование, например, для печати или устного обращения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <comment>Конкуренты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <comment>Прочие отношения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <comment>Обслуживаются торговыми представителями</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <comment>Перевозчики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикетокИЦенников</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.КомпанияЧастноеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПереработчика</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <type>
      <types>EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйВидЦены</name>
    <comment>Уточняющий или индивидуальный вид цены</comment>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Важность</name>
    <comment>Важность клиента</comment>
    <type>
      <types>CatalogRef.CRM_ВажностьКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Имя</name>
    <comment>Имя клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НапоминатьОДнеРождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновнаяОтрасль</name>
    <type>
      <types>CatalogRef.CRM_Отрасли</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновноеКонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновнойАдрес</name>
    <type>
      <types>CatalogRef.CRM_АдресаОфисовКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Отчество</name>
    <comment>Отчество клиента частное лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Потенциал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СегментРынка</name>
    <comment>Сегмент рынка клиента</comment>
    <type>
      <types>CatalogRef.CRM_СегментыРынка</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СтатусРаботы</name>
    <comment>Статус работы с клиентом</comment>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТипОтношенийПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фамилия</name>
    <comment>Фамилия клиента частное лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ФизЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПартнерыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЧисленностьРабочихМест</name>
    <comment>Численность рабочих мест клиента</comment>
    <type>
      <types>CatalogRef.CRM_ЧисленностьРабочихМестКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЧисленностьСотрудников</name>
    <comment>Численность сотрудников клиента</comment>
    <type>
      <types>CatalogRef.CRM_ЧисленностьСотрудниковКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>сфпCoMagicID</name>
    <comment>Идентификатор контакта в системе CoMagic</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпПользовательДляПереключенияЗвонков</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Госорганы</name>
    <comment>Клиент является государственной организацией</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Учредитель</name>
    <comment>Клиент является учредителем</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сфпПрефиксНабора</name>
      <type>
        <types>CatalogRef.сфпПрефиксыИсходящихВызовов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ВидыДеятельности</name>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.CRM_Отрасли</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ТипыОтношений</name>
    <attributes>
      <name>ТипОтношений</name>
      <type>
        <types>CatalogRef.CRM_ТипыОтношений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ПравилаРасчетаКачестваЗаполненияДанных/Forms/ФормаНастройки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ключ") Тогда
		ПерейтиКЭлементу = Параметры.Ключ.СтатусРаботыСКлиентом;
	ИначеЕсли Параметры.Свойство("СтатусРаботыСКлиентом") Тогда
		ПерейтиКЭлементу = Параметры.СтатусРаботыСКлиентом;
	КонецЕсли;
	ЗаполнитьСписокВыбораДоступныхТиповОбъектов(Параметры);
	ЗаполнитьИменаШаблонов();
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		СписокСтатусов, 
		"ТипОбъекта", 
		ТипОбъекта, 
		Истина);
		
	ЗаполнитьУсловноеОформлениеСпискаСтатусов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ПерейтиКЭлементу) Тогда
		ПодключитьОбработчикОжидания("ПерейтиКЭлементу", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьПродолжить", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Настройки изменены, выйти из режима настройки?'"),
			РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	Если ТипОбъекта = "" Тогда
		ТипОбъекта = Элементы.ТипОбъекта.СписокВыбора[0].Значение;
	КонецЕсли;
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ТипОбъектаПриИзмененииПродолжить", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Настройки изменены, сохранить настройки?'"),
			РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;
	ЗаполнитьИменаШаблонов();
	ПриИзмененииСтатуса();
	ОчиститьБуферКопирования();
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		СписокСтатусов, 
		"ТипОбъекта", 
		ТипОбъекта, 
		Истина); 
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаПриИзмененииПродолжить(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьИзменения();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Если ЗначениеЗаполнено(АдресХранилищаОбъектовПравил) Тогда
			УдалитьИзВременногоХранилища(АдресХранилищаОбъектовПравил);
			АдресХранилищаОбъектовПравил = "";
		КонецЕсли;
	Иначе
		ТипОбъекта = ТекПравило.ТипОбъекта;
		Возврат;
	КонецЕсли;
	Модифицированность = Ложь;
	ТекПравилоМодифицировано = Ложь;
	ЗаполнитьИменаШаблонов();
	ОчиститьБуферКопирования();
КонецПроцедуры

#КонецОбласти
	
#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура СписокСтатусовПриАктивизацииСтроки(Элемент)
	ПриИзмененииСтатуса();
	ПравилаПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ТекПревилоПравилаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТекПревилоПравилаУсловиеПредставление" Тогда
		СтандартнаяОбработка = Ложь;
		ТекСтрока = Элементы.Правила.ТекущиеДанные;
		Если ТекСтрока = Неопределено Тогда
			Возврат;	
		КонецЕсли;
		
		ИмяМакета = ПолучитьИмяМакетаНастроек(ТипОбъекта);
		Если Не ЗначениеЗаполнено(ИмяМакета) Тогда
			Возврат;	
		КонецЕсли; 
		
		ИДСтроки = ТекСтрока.ПолучитьИдентификатор();
		
		ПараметрыКомпоновки = Новый Структура;
		ПараметрыКомпоновки.Вставить("НастройкиКомпоновкиДанных", ПолучитьНастройкиКомпоновки(ИДСтроки));
		ПараметрыКомпоновки.Вставить("ИмяОбъектаМетаданных", "Справочник.CRM_ПравилаРасчетаКачестваЗаполненияДанных");
		ПараметрыКомпоновки.Вставить("ИмяМакета", ИмяМакета);
				
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииНастроекКомпоновкиДанных", ЭтотОбъект, ИДСтроки);
		
		ОткрытьФорму("ОбщаяФорма.CRM_НастройкиКомпоновкиДанных", ПараметрыКомпоновки, ЭтотОбъект,,,, ОписаниеОповещения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНастройкиКомпоновки(ИДСтроки)
	
	Если ЗначениеЗаполнено(АдресХранилищаКомпоновщикНастроек) Тогда
		СоответствиеНастройкиХранилищеЗначения = ПолучитьИзВременногоХранилища(АдресХранилищаКомпоновщикНастроек);
		Если ТипЗнч(СоответствиеНастройкиХранилищеЗначения) = Тип("Соответствие") Тогда			
			НастройкаКомпоновки = СоответствиеНастройкиХранилищеЗначения.Получить(ИДСтроки);
			Если ТипЗнч(НастройкаКомпоновки) = Тип("НастройкиКомпоновкиДанных") Тогда
				Возврат НастройкаКомпоновки;
			КонецЕсли; 
		КонецЕсли;                                                      	
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

&НаКлиенте
Процедура ПравилаПриИзменении(Элемент)
	ТекПравилоМодифицировано = Истина;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УсловиеПредставлениеДляПользователяПриИзменении(Элемент)
    Элементы.Правила.ТекущиеДанные.УсловиеПредставление = 
		Элементы.Правила.ТекущиеДанные.УсловиеПредставлениеДляПользователя;
	ТекПравилоМодифицировано = Истина;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.Правила.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		Возврат;
	КонецЕсли;
	
	ИмяМакета = ПолучитьИмяМакетаНастроек(ТипОбъекта);
	Если Не ЗначениеЗаполнено(ИмяМакета) Тогда
		Возврат;	
	КонецЕсли; 
	
	ИДСтроки = ТекСтрока.ПолучитьИдентификатор();
	
	ТекНастройки = ПолучитьНастройкиКомпоновки(ИДСтроки);
	Если ТекНастройки = Неопределено Тогда
		КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьНастройкиКомпоновки(ИДСтроки));
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("РазвернутьСтрокиОтбора", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСтрокиОтбора()
	ОтборКД = КомпоновщикНастроек.Настройки.Отбор;
	Для Каждого ЭлементОтбора Из ОтборКД.Элементы Цикл
		Идентификатор = ОтборКД.ПолучитьИдентификаторПоОбъекту(ЭлементОтбора);
		Элементы.КомпоновщикНастроекНастройкиОтбор.Развернуть(Идентификатор);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область ОбаботчикиКомандФормы

&НаСервере
Процедура ЗаполнитьПоШаблонуНаСервере(КомандаИмя)
	
	ИмяВарианта = СтрЗаменить(КомандаИмя, "Команда_ЗаполнитьПоШаблону_", "");
	
	ИмяМакета = ПолучитьИмяМакетаНастроек(ТипОбъекта);
	Если Не ЗначениеЗаполнено(ИмяМакета) Тогда
		Возврат;	
	КонецЕсли;

	ТекПравило.Правила.Очистить();
	
	СКД = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ПолучитьМакет(ИмяМакета);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	Для Каждого Вариант Из СКД.ВариантыНастроек Цикл
		Если Вариант.Имя = ИмяВарианта Тогда
			Для Каждого ЭлементОтбора Из Вариант.Настройки.Отбор.Элементы Цикл
				КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
				ЗаполнитьЭлементОтбораКомпоновщика(КомпоновщикНастроек.Настройки.Отбор.Элементы, ЭлементОтбора);

				Представление = Строка(КомпоновщикНастроек.Настройки.Отбор);
				Вес = 0;
				Если ЗначениеЗаполнено(ЭлементОтбора.Представление) Тогда
					ДанныеПоУсловию = CRM_ОбщегоНазначенияСервер.ЗначениеИзСтрокиJSON(ЭлементОтбора.Представление);
					Если ДанныеПоУсловию.Свойство("Представление") Тогда
						Представление = ДанныеПоУсловию.Представление;
					КонецЕсли;
					Если ДанныеПоУсловию.Свойство("Вес") Тогда
						Вес = ДанныеПоУсловию.Вес;
					КонецЕсли;
				КонецЕсли;
				
				Правило = ТекПравило.Правила.Добавить();
				ИДСтроки = Правило.ПолучитьИдентификатор();
				Правило.УсловиеПредставление = Представление;
				Правило.УсловиеПредставлениеДляПользователя = Представление;
				Правило.Вес = Вес;
				ОбновитьНастройкиКомпоновки(ИДСтроки, КомпоновщикНастроек.Настройки);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьПоШаблону(Команда)
	ЗаполнитьПоШаблонуНаСервере(Команда.Имя);
	Модифицированность = Истина;
	ТекПравилоМодифицировано = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	Если Модифицированность Тогда
		ЗаписатьИзменения();
	КонецЕсли;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьПродолжить", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Настройки изменены, выйти из режима настройки?'"),
			РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПродолжить(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Копировать(Команда)
	
	ВыделенныеСтроки = Элементы.Правила.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Соответствие = ПолучитьИзВременногоХранилища(АдресХранилищаКомпоновщикНастроек);
	ДанныеКопирования = Новый Массив;
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ТекДанные = ТекПравило.Правила.НайтиПоИдентификатору(Строка);
		ДанныеКопии = Новый Структура;
		ДанныеКопии.Вставить("Условие", Соответствие.Получить(Строка));
		ДанныеКопии.Вставить("УсловиеПредставление", ТекДанные.УсловиеПредставление);
		ДанныеКопии.Вставить("Вес", ТекДанные.Вес);
		ДанныеКопии.Вставить("УсловиеПредставлениеДляПользователя", ТекДанные.УсловиеПредставлениеДляПользователя);
		
		ДанныеКопирования.Добавить(ДанныеКопии);
	КонецЦикла;
	
	АдресБуфераКопирования = ПоместитьВоВременноеХранилище(ДанныеКопирования, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Вставить(Команда)
	
	Если Не ЭтоАдресВременногоХранилища(АдресБуфераКопирования) Тогда
		Возврат;
	КонецЕсли;
	ДанныеКопирования = ПолучитьИзВременногоХранилища(АдресБуфераКопирования);

	Для Каждого ДанныеКопии Из ДанныеКопирования Цикл
		Правило = ТекПравило.Правила.Добавить();
		ИДСтроки = Правило.ПолучитьИдентификатор();
		Правило.УсловиеПредставление = ДанныеКопии.УсловиеПредставление;
		Правило.Вес = ДанныеКопии.Вес;
		Правило.УсловиеПредставлениеДляПользователя = ДанныеКопии.УсловиеПредставлениеДляПользователя;
		Если ДанныеКопии.Условие <> Неопределено Тогда
			ОбновитьНастройкиКомпоновки(ИДСтроки, ДанныеКопии.Условие);
		КонецЕсли;
	КонецЦикла;

	ТекПравилоМодифицировано = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

	
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПерейтиКЭлементу()
	Элементы.СписокСтатусов.ТекущаяСтрока = ПерейтиКЭлементу;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяМакетаНастроек(ТипОбъекта)

	Возврат Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ПолучитьИмяМакетаНастроек(ТипОбъекта);	

КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораДоступныхТиповОбъектов(Параметры)
	
	Элементы.ТипОбъекта.СписокВыбора.Добавить("Справочник.Партнеры", "Клиенты");	 
	Элементы.ТипОбъекта.СписокВыбора.Добавить("Справочник.КонтактныеЛицаПартнеров", "Контактные лица");	 
	Если Не Параметры.Свойство("ТипОбъекта", ТипОбъекта) Тогда
		ТипОбъекта = "Справочник.Партнеры";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИменаШаблонов()
	
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого Элемент Из Элементы.ПодменюЗаполнитьПоШаблону.ПодчиненныеЭлементы Цикл
		ИмяКоманды = СтрЗаменить(Элемент.Имя, "Элемент_ЗаполнитьПоШаблону_", "Команда_ЗаполнитьПоШаблону_");
		УдаляемыеЭлементы.Добавить(Элемент.Имя); 
		Команда = Команды.Найти(ИмяКоманды);
		Если Команда <> Неопределено Тогда
			Команды.Удалить(Команда);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Элемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(Элементы[Элемент]);
	КонецЦикла;
	
	ИмяМакета = ПолучитьИмяМакетаНастроек(ТипОбъекта);
	Если Не ЗначениеЗаполнено(ИмяМакета) Тогда
		Возврат;	
	КонецЕсли;
	
	СКД = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ПолучитьМакет(ИмяМакета);
	Для Каждого Вариант Из СКД.ВариантыНастроек Цикл
		Если Вариант.Имя = "Основной" Тогда
			Продолжить;
		КонецЕсли;
		
		Команда = Команды.Добавить("Команда_ЗаполнитьПоШаблону_" + Вариант.Имя);
		Команда.Действие = "Подключаемый_ЗаполнитьПоШаблону";
		Команда.Заголовок = Вариант.Представление;
		
		НовыйПунктМеню = Элементы.Добавить("Элемент_ЗаполнитьПоШаблону_" + Вариант.Имя, Тип("КнопкаФормы"),
			Элементы.ПодменюЗаполнитьПоШаблону);
		НовыйПунктМеню.ИмяКоманды = Команда.Имя;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьНастройкиВоВременноеХранилище(ОбъектПравил)
	
	СоответствиеПравила = Новый Соответствие;
	Для каждого Правило Из ТекПравило.Правила Цикл
		СтрокаХранилищеНастройки = ОбъектПравил.Правила.Получить(ТекПравило.Правила.Индекс(Правило));
		СоответствиеПравила.Вставить(Правило.ПолучитьИдентификатор(), СтрокаХранилищеНастройки.Условие.Получить());	
	КонецЦикла;  
	
	АдресХранилищаКомпоновщикНастроек = ПоместитьВоВременноеХранилище(СоответствиеПравила, УникальныйИдентификатор);	

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНастроекКомпоновкиДанных(Результат, ИДСтроки) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока = ТекПравило.Правила.НайтиПоИдентификатору(ИДСтроки);
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока.УсловиеПредставление = Результат.ПредставлениеОтбора;
	ТекСтрока.УсловиеПредставлениеДляПользователя = Результат.ПредставлениеОтбора;
	ОбновитьНастройкиКомпоновки(ИДСтроки, Результат.Настройки);
	КомпоновщикНастроек.ЗагрузитьНастройки(Результат.Настройки);
	Модифицированность = Истина;
	ТекПравилоМодифицировано = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиКомпоновки(ИДСтроки, Настройки)
	
	Соответствие = ПолучитьИзВременногоХранилища(АдресХранилищаКомпоновщикНастроек);
	ТекНастройки = ?(ЗначениеЗаполнено(Настройки.Отбор), Настройки, Неопределено);
	Соответствие.Вставить(ИДСтроки, ТекНастройки);
	
	АдресХранилищаКомпоновщикНастроек = ПоместитьВоВременноеХранилище(Соответствие, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаименование(ТипОбъекта, СтатусРаботыСКлиентом)

	МассивНаименование = Новый Массив;
	
	Если ЗначениеЗаполнено(ТипОбъекта) Тогда
		МассивНаименование.Добавить(ТипОбъекта);	
	КонецЕсли; 
	Если ЗначениеЗаполнено(СтатусРаботыСКлиентом) Тогда
		МассивНаименование.Добавить(СтатусРаботыСКлиентом.Наименование);	
	КонецЕсли;
	
	Возврат СтрСоединить(МассивНаименование, " ");
	
КонецФункции 

Процедура ЗаполнитьЭлементОтбораКомпоновщика(ЭлементыОтбора, Источник)
	Если ТипЗнч(Источник) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		НовыйЭлемент = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, Источник);
		НовыйЭлемент.Представление = "";
	Иначе
		НоваяГруппа = ЭлементыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(НоваяГруппа, Источник);
		Для Каждого ЭлементОтбора Из Источник.Элементы Цикл
			ЗаполнитьЭлементОтбораКомпоновщика(НоваяГруппа.Элементы, ЭлементОтбора);
		КонецЦикла;
		НоваяГруппа.Представление = "";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСтатуса()
	
	ТекСтатус = Элементы.СписокСтатусов.ТекущаяСтрока;
	
	Если ЭтоАдресВременногоХранилища(АдресХранилищаОбъектовПравил) Тогда
		СоответствиеОбъектов = ПолучитьИзВременногоХранилища(АдресХранилищаОбъектовПравил);
	Иначе
		СоответствиеОбъектов = Новый Соответствие;
	КонецЕсли;
	
	Если ТекПравилоМодифицировано Тогда
		ТекущийОбъект = РеквизитФормыВЗначение("ТекПравило");
		Соответствие = ПолучитьИзВременногоХранилища(АдресХранилищаКомпоновщикНастроек);
		ТекущийОбъект.Правила.Очистить();
	
		Для каждого СтрокаНастроки Из ТекПравило.Правила Цикл
			ТекСтрока = ТекущийОбъект.Правила.Добавить();
			ЗаполнитьЗначенияСвойств(ТекСтрока, СтрокаНастроки);
			ТекСтрока.Условие = Новый ХранилищеЗначения(Соответствие.Получить(СтрокаНастроки.ПолучитьИдентификатор()));
		КонецЦикла;
		
		СоответствиеОбъектов.Вставить(ТекПравило.СтатусРаботыСКлиентом, ТекущийОбъект);
		АдресХранилищаОбъектовПравил = ПоместитьВоВременноеХранилище(СоответствиеОбъектов, УникальныйИдентификатор);
	КонецЕсли;
	
	ОбъектПравил = СоответствиеОбъектов.Получить(ТекСтатус);
	Если ОбъектПравил = Неопределено Тогда
		Правило = НайтиПравило(ТипОбъекта, ТекСтатус);
		Если Правило = Неопределено Тогда
			ОбъектПравил = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
			ОбъектПравил.ТипОбъекта = ТипОбъекта;
			ОбъектПравил.СтатусРаботыСКлиентом = ТекСтатус;
			ОбъектПравил.Наименование = ПолучитьНаименование(ТипОбъекта, ТекСтатус);
		Иначе
			ОбъектПравил = Правило.ПолучитьОбъект();
		КонецЕсли;
		ТекПравилоМодифицировано = Ложь;
	Иначе
		ТекПравилоМодифицировано = Истина;
	КонецЕсли;
	
	
	ЗначениеВРеквизитФормы(ОбъектПравил, "ТекПравило");
	ПоместитьНастройкиВоВременноеХранилище(ОбъектПравил);
	
КонецПроцедуры

&НаСервере
Функция НайтиПравило(ТипОбъекта, ТекСтатус)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ПравилаРасчетаКачестваЗаполненияДанных.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_ПравилаРасчетаКачестваЗаполненияДанных КАК CRM_ПравилаРасчетаКачестваЗаполненияДанных
	                      |ГДЕ
	                      |	CRM_ПравилаРасчетаКачестваЗаполненияДанных.ТипОбъекта = &ТипОбъекта
	                      |	И CRM_ПравилаРасчетаКачестваЗаполненияДанных.СтатусРаботыСКлиентом = &Статус");
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("Статус", ТекСтатус);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ЗаписатьИзменения()
	
	Если ЭтоАдресВременногоХранилища(АдресХранилищаОбъектовПравил) Тогда
		СоответствиеОбъектов = ПолучитьИзВременногоХранилища(АдресХранилищаОбъектовПравил);
		УдалитьИзВременногоХранилища(АдресХранилищаОбъектовПравил);
		АдресХранилищаОбъектовПравил = "";
	Иначе
		СоответствиеОбъектов = Новый Соответствие;
	КонецЕсли;
	
	Если ТекПравилоМодифицировано Тогда
		ПравилоОбъект = РеквизитФормыВЗначение("ТекПравило");
		Соответствие = ПолучитьИзВременногоХранилища(АдресХранилищаКомпоновщикНастроек);
		ПравилоОбъект.Правила.Очистить();
	
		Для каждого СтрокаНастроки Из ТекПравило.Правила Цикл
			ТекСтрока = ПравилоОбъект.Правила.Добавить();
			ЗаполнитьЗначенияСвойств(ТекСтрока, СтрокаНастроки);
			ТекСтрока.Условие = Новый ХранилищеЗначения(Соответствие.Получить(СтрокаНастроки.ПолучитьИдентификатор()));
		КонецЦикла;
		ПравилоОбъект.Записать();
	КонецЕсли;
	
	Для Каждого КлючЗначение Из СоответствиеОбъектов Цикл
		Если КлючЗначение.Ключ <> ТекСтатус Тогда
			ПравилоОбъект = КлючЗначение.Значение;
			ПравилоОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	Модифицированность = Ложь;
	ТекПравилоМодифицировано = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьБуферКопирования()

	Если ЭтоАдресВременногоХранилища(АдресБуфераКопирования) Тогда
		УдалитьИзВременногоХранилища(АдресБуфераКопирования);
	КонецЕсли;
	АдресБуфераКопирования = "";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловноеОформлениеСпискаСтатусов()
	
	УО = СписокСтатусов.УсловноеОформление;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	CRM_СтатусыРаботыСКлиентом.ЦветФона КАК ЦветФона
	                      |ИЗ
	                      |	Справочник.CRM_СтатусыРаботыСКлиентом КАК CRM_СтатусыРаботыСКлиентом");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.ЦветФона) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивRGB = СтрРазделить(Выборка.ЦветФона, ";");
		Если МассивRGB.Количество() = 3 Тогда
			
			ЦветФона = Новый Цвет(Число(МассивRGB[0]), Число(МассивRGB[1]), Число(МассивRGB[2]));
			ЦветТекста = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьКонтрастныйЦвет(ЦветФона);
			
			ЭлементУО = УО.Элементы.Добавить();
			
			ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Наименование");
			
			ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветФона");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ОтборЭлемента.ПравоеЗначение = Выборка.ЦветФона;
			
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекста);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
